7767517
201 234
Input                    in0                      0 1 in0
Convolution              conv_6                   1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
Swish                    silu_68                  1 1 1 2
Convolution              conv_7                   1 1 2 3 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608
Swish                    silu_69                  1 1 3 4
Split                    splitncnn_0              1 2 4 5 6
Convolution              conv_8                   1 1 6 7 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_70                  1 1 7 8
ConvolutionDepthWise     convdw_136               1 1 8 9 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Swish                    silu_71                  1 1 9 10
Convolution              conv_9                   1 1 10 11 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
BinaryOp                 add_0                    2 1 5 11 12 0=0
Convolution              conv_10                  1 1 12 13 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_72                  1 1 13 14
Split                    splitncnn_1              1 2 14 15 16
Convolution              conv_11                  1 1 16 17 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_73                  1 1 17 18
ConvolutionDepthWise     convdw_137               1 1 18 19 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Swish                    silu_74                  1 1 19 20
Convolution              conv_12                  1 1 20 21 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_1                    2 1 15 21 22 0=0
Split                    splitncnn_2              1 2 22 23 24
Convolution              conv_13                  1 1 24 25 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_75                  1 1 25 26
ConvolutionDepthWise     convdw_138               1 1 26 27 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Swish                    silu_76                  1 1 27 28
Convolution              conv_14                  1 1 28 29 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_2                    2 1 23 29 30 0=0
Split                    splitncnn_3              1 2 30 31 32
Pooling                  gap_0                    1 1 32 33 0=1 4=1
Reshape                  reshape_120              1 1 33 34 0=64 1=1
Convolution1D            conv1dsigmoid_0          1 1 34 35 0=1 1=35 2=1 3=1 4=17 5=0 6=35 9=4
Reshape                  reshape_121              1 1 35 36 0=1 1=1 2=64
BinaryOp                 mul_3                    2 1 31 36 37 0=2
Split                    splitncnn_4              1 2 37 38 39
Convolution              conv_15                  1 1 39 40 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_77                  1 1 40 41
Split                    splitncnn_5              1 2 41 42 43
Convolution              conv_16                  1 1 43 44 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_78                  1 1 44 45
ConvolutionDepthWise     convdw_139               1 1 45 46 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Swish                    silu_79                  1 1 46 47
Convolution              conv_17                  1 1 47 48 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_4                    2 1 42 48 49 0=0
Split                    splitncnn_6              1 2 49 50 51
Convolution              conv_18                  1 1 51 52 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_80                  1 1 52 53
ConvolutionDepthWise     convdw_140               1 1 53 54 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Swish                    silu_81                  1 1 54 55
Convolution              conv_19                  1 1 55 56 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_5                    2 1 50 56 57 0=0
Split                    splitncnn_7              1 2 57 58 59
Pooling                  gap_1                    1 1 59 60 0=1 4=1
Reshape                  reshape_122              1 1 60 61 0=128 1=1
Convolution1D            conv1dsigmoid_1          1 1 61 62 0=1 1=67 2=1 3=1 4=33 5=0 6=67 9=4
Reshape                  reshape_123              1 1 62 63 0=1 1=1 2=128
BinaryOp                 mul_6                    2 1 58 63 64 0=2
Split                    splitncnn_8              1 2 64 65 66
Convolution              conv_20                  1 1 66 67 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912
Swish                    silu_82                  1 1 67 68
Split                    splitncnn_9              1 2 68 69 70
Convolution              conv_21                  1 1 70 71 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_83                  1 1 71 72
ConvolutionDepthWise     convdw_141               1 1 72 73 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Swish                    silu_84                  1 1 73 74
Convolution              conv_22                  1 1 74 75 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_7                    2 1 69 75 76 0=0
Split                    splitncnn_10             1 2 76 77 78
Pooling                  gap_2                    1 1 78 79 0=1 4=1
Reshape                  reshape_124              1 1 79 80 0=256 1=1
Convolution1D            conv1dsigmoid_2          1 1 80 81 0=1 1=133 2=1 3=1 4=66 5=0 6=133 9=4
Reshape                  reshape_125              1 1 81 82 0=1 1=1 2=256
BinaryOp                 mul_8                    2 1 77 82 83 0=2
Convolution              conv_23                  1 1 83 84 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Split                    splitncnn_11             1 2 84 85 86
Pooling                  maxpool2d_62             1 1 86 87 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_12             1 2 87 88 89
Pooling                  maxpool2d_63             1 1 89 90 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_13             1 2 90 91 92
Pooling                  maxpool2d_64             1 1 92 93 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_0                    4 1 85 88 91 93 94 0=0
Convolution              conv_24                  1 1 94 95 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_85                  1 1 95 96
Split                    splitncnn_14             1 2 96 97 98
Interp                   upsample_116             1 1 98 99 0=1 1=2.0 2=2.0 6=0
Concat                   cat_1                    2 1 99 65 100 0=0
Convolution              conv_25                  1 1 100 101 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_86                  1 1 101 102
Slice                    split_0                  1 2 102 103 104 -23300=2,64,64 1=0
Split                    splitncnn_15             1 2 104 105 106
Convolution              conv_26                  1 1 106 107 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_87                  1 1 107 108
Convolution              conv_27                  1 1 108 109 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_88                  1 1 109 110
Concat                   cat_2                    3 1 103 105 110 111 0=0
Convolution              conv_28                  1 1 111 112 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_89                  1 1 112 113
Split                    splitncnn_16             1 2 113 114 115
Interp                   upsample_117             1 1 115 116 0=1 1=2.0 2=2.0 6=0
Concat                   cat_3                    2 1 116 38 117 0=0
Convolution              conv_29                  1 1 117 118 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_90                  1 1 118 119
Slice                    split_1                  1 2 119 120 121 -23300=2,32,32 1=0
Split                    splitncnn_17             1 2 121 122 123
Convolution              conv_30                  1 1 123 124 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_91                  1 1 124 125
Convolution              conv_31                  1 1 125 126 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_92                  1 1 126 127
Concat                   cat_4                    3 1 120 122 127 128 0=0
Convolution              conv_32                  1 1 128 129 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_93                  1 1 129 130
Split                    splitncnn_18             1 3 130 131 132 133
Convolution              conv_33                  1 1 133 134 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_94                  1 1 134 135
Concat                   cat_5                    2 1 135 114 136 0=0
Convolution              conv_34                  1 1 136 137 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_95                  1 1 137 138
Slice                    split_2                  1 2 138 139 140 -23300=2,64,64 1=0
Split                    splitncnn_19             1 2 140 141 142
Convolution              conv_35                  1 1 142 143 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_96                  1 1 143 144
Convolution              conv_36                  1 1 144 145 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_97                  1 1 145 146
Concat                   cat_6                    3 1 139 141 146 147 0=0
Convolution              conv_37                  1 1 147 148 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_98                  1 1 148 149
Split                    splitncnn_20             1 3 149 150 151 152
Convolution              conv_38                  1 1 152 153 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_99                  1 1 153 154
Concat                   cat_7                    2 1 154 97 155 0=0
Convolution              conv_39                  1 1 155 156 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_100                 1 1 156 157
Slice                    split_3                  1 2 157 158 159 -23300=2,128,128 1=0
Split                    splitncnn_21             1 2 159 160 161
Convolution              conv_40                  1 1 161 162 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_101                 1 1 162 163
Convolution              conv_41                  1 1 163 164 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_102                 1 1 164 165
Concat                   cat_8                    3 1 158 160 165 166 0=0
Convolution              conv_42                  1 1 166 167 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_103                 1 1 167 168
Split                    splitncnn_22             1 2 168 169 170
MemoryData               pnnx_124                 0 1 171 0=21504
Convolution              conv_43                  1 1 132 172 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_104                 1 1 172 173
Convolution              conv_44                  1 1 173 174 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_105                 1 1 174 175
Convolution              conv_45                  1 1 175 176 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Reshape                  reshape_126              1 1 176 177 0=16384 1=64
Convolution              conv_46                  1 1 151 178 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_106                 1 1 178 179
Convolution              conv_47                  1 1 179 180 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_107                 1 1 180 181
Convolution              conv_48                  1 1 181 182 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Reshape                  reshape_127              1 1 182 183 0=4096 1=64
Convolution              conv_49                  1 1 170 184 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_108                 1 1 184 185
Convolution              conv_50                  1 1 185 186 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_109                 1 1 186 187
Convolution              conv_51                  1 1 187 188 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Reshape                  reshape_128              1 1 188 189 0=1024 1=64
Concat                   cat_9                    3 1 177 183 189 190 0=1
Convolution              conv_52                  1 1 131 191 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_110                 1 1 191 192
Convolution              conv_53                  1 1 192 193 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_111                 1 1 193 194
Convolution              conv_54                  1 1 194 195 0=5 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=320
Reshape                  reshape_129              1 1 195 196 0=16384 1=5
Convolution              conv_55                  1 1 150 197 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_112                 1 1 197 198
Convolution              conv_56                  1 1 198 199 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_113                 1 1 199 200
Convolution              conv_57                  1 1 200 201 0=5 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=320
Reshape                  reshape_130              1 1 201 202 0=4096 1=5
Convolution              conv_58                  1 1 169 203 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_114                 1 1 203 204
Convolution              conv_59                  1 1 204 205 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_115                 1 1 205 206
Convolution              conv_60                  1 1 206 207 0=5 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=320
Reshape                  reshape_131              1 1 207 208 0=1024 1=5
Concat                   cat_10                   3 1 196 202 208 209 0=1
Reshape                  reshape_132              1 1 190 210 0=21504 1=16 2=4
Permute                  transpose_135            1 1 210 211 0=2
Softmax                  softmax_119              1 1 211 212 0=0 1=1
Convolution              conv_61                  1 1 212 213 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  reshape_133              1 1 213 214 0=21504 1=4
MemoryData               pnnx_fold_anchor_points.1 0 1 215 0=21504 1=2
Split                    splitncnn_0              1 2 215 216 217
Slice                    chunk_0                  1 2 214 218 219 -23300=2,-233,-233 1=0
BinaryOp                 sub_9                    2 1 216 218 220 0=1
Split                    splitncnn_23             1 2 220 221 222
BinaryOp                 add_10                   2 1 217 219 223 0=0
Split                    splitncnn_24             1 2 223 224 225
BinaryOp                 add_11                   2 1 221 224 226 0=0
BinaryOp                 div_12                   1 1 226 227 0=3 1=1 2=2.0
BinaryOp                 sub_13                   2 1 225 222 228 0=1
Concat                   cat_11                   2 1 227 228 229 0=0
Reshape                  reshape_134              1 1 171 230 0=21504 1=1
BinaryOp                 mul_14                   2 1 229 230 231 0=2
Sigmoid                  sigmoid_118              1 1 209 232
Concat                   cat_12                   2 1 231 232 out0 0=0
